In [2]:
import pandas as pd
titanic = pd.read_csv("../data/titanic.csv")

In [4]:
titanic.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [7]:
titanic.shape

(891, 12)

In [11]:
age_sex = titanic[["Age", "Sex"]]
print(age_sex)

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [36]:
above_35 = titanic["Age"] > 35
print(f"There were a total of {len(above_35)} passengers on the titanic")
i: int = 0
n: int = 0
while i < 891:
    if above_35[i] == True:
        n += 1
    i += 1
print(f"There were {n} passengers on the titanic over the age of 35")

There were a total of 891 passengers on the titanic
There were 217 passengers on the titanic over the age of 35